#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_dynamodb_table.visitors_app_table: Refreshing state... [id=Visitors]
aws_api_gateway_rest_api.visitors_rest_api: Refreshing state... [id=44ts8mx4qf]
aws_iam_role.lambda_cust_role: Refreshing state... [id=lambda_cust_role]
aws_iam_role_policy.lambda_cust_policy: Refreshing state... [id=lambda_cust_role:lambda_cust_policy]
aws_lambda_layer_version.visitors_app_layer: Refreshing state... [id=arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:23]
aws_api_gateway_resource.visitors_app_proxy: Refreshing state... [id=8zyza0]
aws_api_gateway_method.visitors_gateway_proxy: Refreshing state... [id=agm-44ts8mx4qf-8zyza0-ANY]
aws_lambda_function.visitorsapp: Refreshing state... [id=visitorsapp]
aws_api_gateway_integration.visitors_app_lambda: Refreshing state... [id=agi-44ts8mx4qf-8zyza0-ANY]
aws_lambda_permission.visitors_apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.visitors_app_api_gateway_deploy: Refreshing state... [id=3g1h5j]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.visitorsapp will be updated in-place
  ~ resource "aws_lambda_function" "visitorsapp" {
        id                             = "visitorsapp"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:23",
        ] -> (known after apply)
        tags                           = {}
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.visitors_app_layer must be replaced
-/+ resource "aws_lambda_layer_version" "visitors_app_layer" {
      ~ arn                 = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:23" -> (known after apply)
      ~ created_date        = "2021-04-02T18:11:56.848+0000" -> (known after apply)
      ~ id                  = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:23" -> (known after apply)
      ~ layer_arn           = "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer" -> (known after apply)
      ~ source_code_hash    = "rX9j8AAF/IKso00KN0XvjOWa68OkyoiPlOkWD3ESbS0=" -> "jJ6F/sq/rW+93uNoW2fTy/oUSFF58tg68i26dZMz6eU=" # forces replacement
      ~ source_code_size    = 10181634 -> (known after apply)
      ~ version             = "23" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @lebergarrett, Action: `pull_request`*